# Homebrew
update
upgrade

# CLI tools
brew "docker"
brew "docker-completion"
brew "devcontainer"
brew "btop"
brew "ncdu"
brew "webp"
brew "wget"
brew "curl"
brew "composer"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "git"
brew "gh"
brew "go"
brew "mole"
brew "stats"
brew "codex"

# Cask applications
cask "alfred"
cask "appcleaner"
cask "notion"
cask "microsoft-teams"
cask "zoom"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "github"
cask "raycast"
cask "monitorcontrol"
cask "visual-studio-code"
cask "iterm2"
cask "kekaexternalhelper"
cask "codex-app"
cask "docker-desktop"
cask "stats"
cask "tomatobar"
cask "zotero"
